OpenFOAM-master/of-xp/OpenFOAM-2.3.1/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Heater
    {
        name    heater;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.01001    0 -100 )(0.01001 0.00999 100);
        }
    }
    {
        name    heater;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box (-0.01001 -100 -0.01001)(0.01001 0.00999 0.01001);
        }
    }
    {
        name    heater;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set heater;           // name of cellSet
        }
    }

    // leftSolid
    {
        name    leftSolid;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 0 -100 )(-0.01001 0.00999 100);
        }
    }
    {
        name    leftSolid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set leftSolid;
        }
    }

    // rightSolid
    {
        name    rightSolid;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.01001 0 -100 )(100 0.00999 100);
        }
    }
    {
        name    rightSolid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set rightSolid;
        }
    }

    // topAir
    {
        name    topAir;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 0.00999 -100 )(100 100 100);
        }
    }
    {
        name    topAir;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set topAir;
        }
    }


    // bottomWater is all the other cells
    {
        name    bottomWater;
        type    cellZoneSet;
        action  clear;
    }
    {
        name    bottomWater;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set heater;
        }
    }
    {
        name    bottomWater;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set leftSolid;
        }
    }
    {
        name    bottomWater;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set rightSolid;
        }
    }
    {
        name    bottomWater;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set topAir;
        }
    }
    {
        name    bottomWater;
        type    cellSet;
        action  invert;
    }
    {
        name    bottomWater;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set bottomWater;
        }
    }
);

// ************************************************************************* //
